# -*- coding: utf-8 -*-

names = [{
    "Владимир": {"": 0},
    "Вов": {"": 1, "к": 2, "ан": 0, "очк": 2},
    "Волод": {"": 2, "ьк": 1}
}, {
    "Петр": {"": 0},
    "Пётр": {"": 0},
    "Пет": {"": 2, "ьк": 1, "еньк": 1},
}, {
    "Дмитри": {"": 4},
    "Дим": {"": 1, "к": 2, "он": 0},
}, {
    "Федор": {"": 0},
    "Фед": {"": 2, "ьк": 1, "еньк": 1},
}, {
    "Кост": {"": 2, "ьк": 1, "еньк": 1},
    "Константин": {"": 0},
}, {
    "Миш": {"": 1, "к": 1, "еньк": 1},
    "Михаил": {"": 0},
}, {
    "Павлик": {"": 0},
}, {
    "Саш": {"": 1, "к": 1, "еньк": 1},
    "Александр": {"": 0},
}, {
    "Степан": {"": 0},
    "Стёп": {"": 1, "к": 1},
}, {
    "Виктор": {"": 0},
    "Вит": {"": 2, "ьк": 1, "еньк": 1},
}]
