# -*- coding: utf-8 -*-

names = [{
    "Владимир": {"": 0},
    "Вов": {"": 1, "к": 2, "ан": 0, "очк": 2},
    "Волод": {"": 2, "ьк": 1}
}, {
    "Петр": {"": 0},
    "Пётр": {"": 0},
    "Пет": {"": 2, "ьк": 1, "еньк": 1},
}, {
    "Дмитри": {"": 4},
    "Дим": {"": 1, "к": 2, "он": 0},
}, {
    "Федор": {"": 0},
    "Фед": {"": 2, "ьк": 1, "еньк": 1},
}, {
    "Кост": {"": 2, "ьк": 1, "еньк": 1},
    "Константин": {"": 0},
}, {
    "Миш": {"": 1, "к": 1, "еньк": 1},
    "Михаил": {"": 0},
}, {
    "Павлик": {"": 0},
}, {
    "Саш": {"": 1, "к": 1, "еньк": 1},
    "Александр": {"": 0},
}, {
    "Степан": {"": 0},
    "Стёп": {"": 1, "к": 1},
}, {
    "Виктор": {"": 0},
    "Вит": {"": 2, "ьк": 1, "еньк": 1},
}]

ssnames = [
    [
        "Адольф Гитлер",
        "Адольфа Гитлера",
        "Адольфу Гитлеру",
        "Адольфа Гитлера",
        "Адольфом Гитлером",
        "Адольфе Гитлере"
    ],
    [
        "Генрих Гиммлер",
        "Генриха Гиммлера",
        "Генриху Гиммлеру",
        "Генриха Гиммлера",
        "Генрихом Гиммлером",
        "Генрихе Гиммлере"
    ],
    [
        "Юлиус Шрекк",
        "Юлиуса Шрекка",
        "Юлиусу Шрекку",
        "Юлиуса Шрекка",
        "Юлиусом Шрекком",
        "Юлиусе Шрекке"
    ],
    [
        "Вальтер Хек",
        "Вальтера Хека",
        "Вальтеру Хеку",
        "Вальтера Хека",
        "Вальтером Хеком",
        "Вальтере Хеке"
    ],
    [
        "Эрнст Рём",
        "Эрнста Рёма",
        "Эрнсту Рёму",
        "Эрнста Рёма",
        "Эрнстом Рёмом",
        "Эрнсте Рёме"
    ],
    [
        "Август Хайссмайер",
        "Августа Хайссмайера",
        "Августу Хайссмайеру",
        "Августа Хайссмайера",
        "Августом Хайссмайером",
        "Августе Хайссмайере"
    ],
    [
        "Готтлоб Бергер",
        "Готтлоба Бергера",
        "Готтлобу Бергеру",
        "Готтлоба Бергера",
        "Готтлобом Бергером",
        "Готтлобе Бергере"
    ],
    [
        "Отто Хофман",
        "Отто Хофмана",
        "Отто Хофману",
        "Отто Хофмана",
        "Отто Хофманом",
        "Отто Хофмане"
    ],
    [
        "Рихард Гильдебрандт",
        "Рихарда Гильдебрандта",
        "Рихарду Гильдебрандту",
        "Рихарда Гильдебрандта",
        "Рихардом Гильдебрандтом",
        "Рихарде Гильдебрандте"
    ],
    [
        "Хорст Рехенбах",
        "Хорста Рехенбаха",
        "Хорсту Рехенбаху",
        "Хорста Рехенбаха",
        "Хорстом Рехенбахом",
        "Хорсте Рехенбахе"
    ],
    [
        "Георг Эбрехт",
        "Георга Эбрехта",
        "Георгу Эбрехту",
        "Георга Эбрехта",
        "Георгом Эбрехтом",
        "Георге Эбрехте"
    ],
]
